app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT "videos".* FROM "videos"

  def create
    @video = Video.new(video_params)

    video = VideoInfo.new(@video.url)

    @video.name = video.title
    @video.description = video.description
    @video.thumbnail = video.thumbnail_small

    @video.content = Video.request(@video.url)


    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("content", "created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["content", "fsdfs"], ["created_at", "2014-09-20 09:46:11.996394"], ["name", "sfsfsd"], ["updated_at", "2014-09-20 09:46:11.996394"], ["url", "blas"]]

  def destroy
    @video.destroy
---
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]

    def set_video
      @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = ? LIMIT 1  [["id", 980190962]]